import aboutSvg from '../assets/about.jpg'
import SectionTitle from './SectionTitle'

const About = () => {
  return (
    <section className="bg-white py-20" id="about">
      <div className="align-element grid  md:grid-cols-2 items-center gap-16">
        <img src={aboutSvg} className="w-64 h-64 rounded-full mx-auto" />
        <article>
          <SectionTitle text="code and coffee" />
          <p className="text-slate-600 mt-8 leading-loose">
            👋 สวัสดีครับ ผมชื่อเจอา ณ ตอนนี้ผมอยู่กรุงเทพฯ
            กำลังศึกษาอยู่ที่มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ
            คณะวิทยาลัยเทคโนโลยีอุตสาหกรรม ภาควิชาวิศวกรรมอิเล็กทรอนิกส์
            สาขาเทคโนโลยีคอมพิวเตอร์. มีความสนใจอยากเป็น Dev ครับ,
            โครงการวิจัยที่ทำในมหาลัย &quot;ระบบสร้างออเดอร์สินค้าจาก Comments
            วีดีโอไลฟ์สดบน Facebook&quot; โดยใช้ภาษา JavaScript
            ในการสร้างเว็บแอปพลิเคชัน
          </p>
          <p className="text-slate-600 mt-8 leading-loose">
            เมื่อตอนเด็กอยากจะเป็นนักบินขับเครื่องบิน F-16
            แต่พอใช้ชีวิตในโลกแห่งความเป็นจริง ความคิดเปลี่ยน
            เลยอยากเป็นวิศวกรไฟฟ้าแทน เริ่มไปเรียนสายอาชีพ ปวช ช่างไฟฟ้า
            แต่พอเรียนเข้าจริงช่วงสอนทฤษฏีไม่ชอบเลยเพราะคำนวณเยอะมาก
            แต่พอทำงานเน้นปฎิบัติผมทำได้หมด ในช่วงเรียนก็มีเรียนเขียนโปรแกรม
            ภาษาคอมพิวเตอร์ C หรือ C++ ของ Arduino Platform
            ทำให้ได้มีพื้นฐานการเขียนโปรแกรมตั้งแต่สมัย ปวส แล้วพอจบการศึกษา
            ได้ไปทำงานตำแหน่ง Product Technician
            ที่มีสภาพแวดล้อมที่ต้องร่วมมือกับแผนก Product & Developer
            ซึ่งเป็นสิ่งที่ผมสนใจเรื่องอุปกรณ์และโปรแกรมที่ใช้งานเฉพาะธุรกิจนั้นๆ
            เพราะสามารถแก้ไขปัญหาได้ด้วย Software ในช่วงเวลาทำงานนั้น
            หลังเลิกงานมาได้เปิดคลิปตาม Youtube และฝึกเขียนโปรแกรมภาษา Java
            และได้ศึกษาหาวิธีที่จะได้เป็นนักพัฒนาเรื่อยมา
            จนได้ส่งสมัครเรียนต่อเนื่องที่ มจพ. จนถึงปัจจุบัน
          </p>
        </article>
      </div>
    </section>
  )
}
export default About
